import { Builder, bootstrap2, DefaultTemplate, LyricsPresets, SongInfoPresets, VisualizerPresets } from 'av-generator'
import { registerRoot, staticFile } from 'remotion'

const root = () => {
  const lyrics = [
    `1
00:00:00,000 --> 00:00:00,950
 作词 : 高进

2
00:00:01,000 --> 00:00:01,950
 作曲 : 高进

3
00:00:02,000 --> 00:00:12,150
 编曲 : 关天天

4
00:00:12,200 --> 00:00:14,430
我们哭了

5
00:00:14,480 --> 00:00:17,830
我们笑着

6
00:00:17,880 --> 00:00:20,800
我们抬头望天空

7
00:00:20,850 --> 00:00:24,850
星星还亮着几颗

8
00:00:24,900 --> 00:00:27,100
我们唱着

9
00:00:27,150 --> 00:00:30,220
时间的歌

10
00:00:30,270 --> 00:00:33,130
才懂得相互拥抱

11
00:00:33,180 --> 00:00:36,240
到底是为了什么

12
00:00:36,290 --> 00:00:39,700
因为我刚好遇见你

13
00:00:39,750 --> 00:00:42,840
留下足迹才美丽

14
00:00:42,890 --> 00:00:45,840
风吹花落泪如雨

15
00:00:45,890 --> 00:00:49,650
因为不想分离

16
00:00:49,700 --> 00:00:52,060
因为刚好遇见你

17
00:00:52,110 --> 00:00:55,090
留下十年的期许

18
00:00:55,140 --> 00:00:58,500
如果再相遇

19
00:00:58,550 --> 00:01:03,670
我想我会记得你

20
00:01:13,540 --> 00:01:16,460
我们哭了

21
00:01:16,510 --> 00:01:19,420
我们笑着

22
00:01:19,470 --> 00:01:22,330
我们抬头望天空

23
00:01:22,380 --> 00:01:25,450
星星还亮着几颗

24
00:01:25,500 --> 00:01:27,950
我们唱着

25
00:01:28,000 --> 00:01:31,460
时间的歌

26
00:01:31,510 --> 00:01:34,610
才懂得相互拥抱

27
00:01:34,660 --> 00:01:37,910
到底是为了什么

28
00:01:37,960 --> 00:01:41,050
因为我刚好遇见你

29
00:01:41,100 --> 00:01:44,450
留下足迹才美丽

30
00:01:44,500 --> 00:01:47,060
风吹花落泪如雨

31
00:01:47,110 --> 00:01:50,520
因为不想分离

32
00:01:50,570 --> 00:01:53,740
因为刚好遇见你

33
00:01:53,790 --> 00:01:56,530
留下十年的期许

34
00:01:56,580 --> 00:01:59,890
如果再相遇

35
00:01:59,940 --> 00:02:02,890
我想我会记得你

36
00:02:02,940 --> 00:02:05,820
因为刚好遇见你

37
00:02:05,870 --> 00:02:08,940
留下足迹才美丽

38
00:02:08,990 --> 00:02:12,150
风吹花落泪如雨

39
00:02:12,200 --> 00:02:15,140
因为不想分离

40
00:02:15,190 --> 00:02:18,070
因为刚好遇见你

41
00:02:18,120 --> 00:02:21,180
留下十年的期许

42
00:02:21,230 --> 00:02:24,530
如果再相遇

43
00:02:24,580 --> 00:02:30,410
我想我会记得你

44
00:02:30,460 --> 00:02:33,360
因为我刚好遇见你

45
00:02:33,410 --> 00:02:36,530
留下足迹才美丽

46
00:02:36,580 --> 00:02:39,360
风吹花落泪如雨

47
00:02:39,410 --> 00:02:42,900
因为不想分离

48
00:02:42,950 --> 00:02:45,630
因为刚好遇见你

49
00:02:45,680 --> 00:02:48,910
留下十年的期许

50
00:02:48,960 --> 00:02:52,190
如果再相遇

51
00:02:52,240 --> 00:02:58,100
我想我会记得你

52
00:02:58,150 --> 00:03:08,150


`
  ]
  return bootstrap2(
    DefaultTemplate,
    Builder.create({ audio: staticFile('a.mp3') })
      .setBackground({
        type: 'carousel',
        images: ['1.png', '2.png', '3.png'].map(staticFile),
        framesPerImage: 1200,
        fadeFrames: 400
      })
      // TODO: better persets mixins
      .setSongInfo(
        ((c) => {
          c.style!.left = '20px'
          c.titleStyle!.color = '#e45ccdff'
          c.subtitleStyle!.color = '#cf75b4ff'
          delete c.style?.right
          return c
        })(SongInfoPresets.topRight(staticFile('icon.png'), '刚好遇见你', 'AI 有村路美'))
      )
      .addVisualizer('waveform', {
        ...VisualizerPresets.waveform.electric(),
        gradientColors: ['#e73a91ff', '#2992e7ff', '#00ccffff']
      })
      .addLyric(
        ((c) => {
          c.style!.color = '#2992e7ff'
          return c
        })(LyricsPresets.single.bottomWithBg(lyrics[0]))
      )
      .build()
  )
}

registerRoot(root)
